#ifndef	 __I2C_H
#define  __I2C_H  	

#ifndef  IN_I2C

    #ifdef __cplusplus
    extern "C" {
    #endif
    
#include "myDef.h"
/*********************************************************************************************************
** Function name: InitI2C
** Descriptions : 初始化IIC总线
** Input : -
** Output: -
** Created Date : 2007-8-2 11:36上午
********************************************************************************************************/
extern void  InitI2C(void);



/*********************************************************************************************************
** Function name: ISendStr
** Descriptions : 使用硬件I2C发送数据。
** Input : sla, 从机地址
**         suba, 器件子地址(第一字节用来表示子地址字节个数)
**         s, 发送数据缓冲区
**         no, 发送数据个数
** Output: 操作成功返回TRUE，仲载失败/无从机应答返回FALSE
** Created Date: 2007-8-2 01:51下午
********************************************************************************************************/
extern int  ISendStr(uint8 sla, uint8 *suba, uint8 *s, uint8 no);



/*********************************************************************************************************
** Function name: IRcvStr
** Descriptions : 使用硬件I2C读取数据。
** Input : sla, 从机地址
*          suba, 器件子地址缓冲区指针(第一字节用来表示子地址字节个数)
*          s, 接收数据缓冲区
*          no, 接收数据个数
** Output: 操作成功返回TRUE，仲载失败/无从机应答返回FALSE
** Created Date : 2007-8-2 02:13下午
********************************************************************************************************/
extern int  IRcvStr(uint8 sla,uint8 *suba,uint8 *s,uint8 no);



/********************************************************************************************************/
    #ifdef __cplusplus
    }
    #endif 

#endif      // IN_I2C    

#endif      // __I2C_H

/* end of file */
